examples/RTInstability/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

buoyancyForce1
{
    // Mandatory entries (unmodifiable)
    type             buoyancyForce;
    fields           (U);

    // Mandatory/Optional (inherited) entries
    selectionMode    all;
}


buoyancyEnergy1
{
    // Mandatory entries (unmodifiable)
    type             buoyancyEnergy;
    fields           (e);

    // Optional entries (runtime modifiable)
    U                U;

    // Mandatory/Optional (inherited) entries
    selectionMode    all;
}


// ************************************************************************* //
