examples/RTInstability/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

yNo     256;
xNo     #eval{ $yNo/4 };
zL      #eval{ 1./$yNo };
xMax    0.125;
xMin    -0.125;

vertices
(
    ($xMin   0    0)
    ($xMax   0    0)
    ($xMax   1    0)
    ($xMin   1    0)
    ($xMin   0    $zL)
    ($xMax   0    $zL)
    ($xMax   1    $zL)
    ($xMin   1    $zL)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($xNo $yNo 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type            wall;
        faces
        (
            (3 7 6 2)
        );
    }

    bottom
    {
        type            wall;
        faces
        (
            (1 5 4 0)
        );
    }

    left
    {
        type            wall;
        faces
        (
            (0 4 7 3)
        );
    }

    right
    {
        type            wall;
        faces
        (
            (2 6 5 1)
        );
    }

    frontAndBack
    {
        type            empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
